{
  "nodes": [
    {
      "op": "null", 
      "name": "/dense_1_input1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(0, 3010)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(3010, 300)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot1", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(300,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu1", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout_1/dropout2", 
      "attrs": {"p": "0.81"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(300, 300)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot3", 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(300,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu3", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout_2/dropout2", 
      "attrs": {"p": "0.81"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_3/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(300, 20)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot5", 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_3/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(20,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add5", 
      "inputs": [[14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax1", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[16, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 3, 7, 9, 13, 15], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20
  ], 
  "heads": [[17, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10401]}
}